<?php
return [
    'dst' => [
        'number1' => '01234',
        'number2' => '1',
        'number3' => '987654',
        'name' => '加入者名',
    ],
    'src' => [
        'postal_number1' => '100',
        'postal_number2' => '8926',
        'address' => "東京都　千代田区　霞が関\n２－１－２",
        'address2' => "東京都　千代田区　霞が関\n２－１－２",
        'name' => '山田　太郎',
        'phone1' => '090',
        'phone2' => '9999',
        'phone3' => '8888',
    ],
    'price' => 8192,
    'note' => implode("\n", [
        'ああああああああああ',
        'いいいいいいいいいい',
        'うううううううううう',
        'ええええええええええ',
        'おおおおおおおおおお',
    ]),
];
